/*Напишите программу, которая читает строку из входного потока (строку целиком до символа переноса строки). Необходимо ее закодировать азбукой Морзе,
где каждой букве ставится в соответствие код (в виде фрагмента строки) из точки и тире. После каждой закодированной буквы должен идти пробел (символ окончания кода буквы).
После последнего кода пробела быть не должно (в конце строки). 

Коды азбуки Морзе приведены ниже для латинского алфавита (большие и малые буквы кодируются одинаково), цифр и символа пробела:
A 	.- 	J 	.--- 	S 	... 	2 	..---
B 	-... 	K 	-.- 	T 	- 	3 	...--
C 	-.-. 	L 	.-.. 	U 	..- 	4 	....-
D 	-.. 	M 	-- 	V 	...- 	5 	.....
E 	. 	N 	-. 	W 	.-- 	6 	-....
F 	..-. 	O 	--- 	X 	-..- 	7 	--...
G 	--. 	P 	.--. 	Y 	-.-- 	8 	---..
H 	.... 	Q 	--.- 	Z 	--.. 	9 	----.
I 	.. 	R 	.-. 	1 	.---- 	0 	-----

Пробел   -...-

Результат кодирования вывести в консоль виде строки.

P. S. Само кодирование лучше реализовать в виде отдельной функции, которой передается формируемая строка, исходная строка и массив азбуки Морзе.

Тесты: https://github.com/selfedu-rus/c-tests/tree/main/6.7.6

Sample Input:

Sergey Balakirev

Sample Output:

... . .-. --. . -.-- -...- -... .- .-.. .- -.- .. .-. . ...-

*/
#include <stdio.h>
#include <string.h>
#include <ctype.h>
int main(void)
{
    char str[100] = {0};
    fgets(str, sizeof(str)-1, stdin);
    char* ptr_n = strrchr(str, '\n');
    if(ptr_n != NULL)
        *ptr_n = '\0';
    char symbols[] = "AJS2BKT3CLU4DMV5ENW6FOX7GPY8HQZ9IR10 ";

    char *morse[] = {".-", ".---",	"...", "..---", "-...", "-.-", "-", 
                 "...--", "-.-.", ".-..", "..-", "....-", "-..", "--", 
                 "...-", ".....", ".", "-.", ".--", "-....", "..-.", 
                 "---", "-..-", "--...", "--.", ".--.", "-.--", 
                 "---..", "....", "--.-", "--..", "----.", "..", ".-.", 
                 ".----", "-----", "-...-"};
    char *ptr1=symbols;
    char *ptr2=strrchr(str,'\0');
    char *ptr=str;
    char *temp=ptr;
    for(int i = 0 ; i < strlen(str);i++){
        ptr = strchr(symbols,toupper(*ptr));
        if(*ptr!=NULL){int ind = ptr-ptr1;
                    
                      ptr=ptr2;
                       
                       ptr2=ptr2+strlen(morse[ind]);
                       while(ptr>temp){
                         *ptr2=*ptr;
                         ptr2--;
                         ptr--;
                       }
                       for(int i = 0 ; i <strlen(morse[ind]);i++){
                         *ptr=morse[ind][i];
                         ptr++;
                       }
                       if(i<strlen(str)-1){*ptr=' ',ptr++;temp=ptr;ptr2=strrchr(str,'\0');}
         
        }else {
          break;
        }
    }puts(str);
    // здесь продолжайте функцию main

    return 0;
}
